#13
a = 0b00001101
#10
b = 0b00001010
#2진법의 음수는 젤 앞 비트 = 1
#~a = NOT(1101) = 1111 0010 = -14 
#~a & 11111111(=255) = 1111 0010 = 음수아님
print("a = ",a,"=",bin(a)) #0b1010
print("~a = ",~a,"=",bin(~a)) #-0b1110
print("~a&255 = ",~a & 255,"=",bin(~a & 255))
print("a<<1 =",a<<1,"=",bin(a<<1))
print("a>>1 = ", a>>1,"=", bin(a>>1))
print("-------------------------")

print("b = ",b,"=",bin(b)) #0b1010
print("~b = ",~b,"=",bin(~b)) #-0b1011
print("~b&255 = ",~b & 255,"=",bin(~b & 255))
print("b<<1 =",b<<1,"=",bin(b<<1))
print("b>>1 = ", b>>1,"=", bin(b>>1))
print("-------------------------")

print("a&b =",a&b,"=",bin(a&b))
print("a|b =", a|b,"=",bin(a|b))
print("a^b =", a^b ,"=",bin(a^b))
